{"class_name": "Sequential", "config": [{"class_name": "BatchNormalization", "config": {"trainable": true, "batch_input_shape": [null, 40, 80, 3], "input_dtype": "float32", "momentum": 0.99, "name": "batchnormalization_1", "gamma_regularizer": null, "axis": 1, "beta_regularizer": null, "epsilon": 0.001, "mode": 2}}, {"class_name": "Convolution2D", "config": {"border_mode": "same", "activation": "linear", "name": "convolution2d_1", "b_regularizer": null, "bias": true, "nb_col": 5, "trainable": true, "nb_filter": 24, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "nb_row": 5, "dim_ordering": "tf", "W_constraint": null, "init": "glorot_uniform", "subsample": [2, 2]}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"border_mode": "same", "activation": "linear", "name": "convolution2d_2", "b_regularizer": null, "bias": true, "nb_col": 5, "trainable": true, "nb_filter": 36, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "nb_row": 5, "dim_ordering": "tf", "W_constraint": null, "init": "glorot_uniform", "subsample": [2, 2]}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.75, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"border_mode": "same", "activation": "linear", "name": "convolution2d_3", "b_regularizer": null, "bias": true, "nb_col": 5, "trainable": true, "nb_filter": 48, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "nb_row": 5, "dim_ordering": "tf", "W_constraint": null, "init": "glorot_uniform", "subsample": [2, 2]}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "activation": "linear", "name": "convolution2d_4", "b_regularizer": null, "bias": true, "nb_col": 3, "trainable": true, "nb_filter": 64, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "nb_row": 3, "dim_ordering": "tf", "W_constraint": null, "init": "glorot_uniform", "subsample": [1, 1]}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "activation": "linear", "name": "convolution2d_5", "b_regularizer": null, "bias": true, "nb_col": 3, "trainable": true, "nb_filter": 64, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "nb_row": 3, "dim_ordering": "tf", "W_constraint": null, "init": "glorot_uniform", "subsample": [1, 1]}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "linear", "input_dtype": "float32", "input_dim": 384, "name": "dense_1", "b_regularizer": null, "bias": true, "output_dim": 1164, "trainable": true, "batch_input_shape": [null, 384], "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_6"}}, {"class_name": "Dense", "config": {"activation": "linear", "input_dtype": "float32", "input_dim": 1164, "name": "dense_2", "b_regularizer": null, "bias": true, "output_dim": 100, "trainable": true, "batch_input_shape": [null, 1164], "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_7"}}, {"class_name": "Dense", "config": {"activation": "linear", "input_dtype": "float32", "input_dim": 100, "name": "dense_3", "b_regularizer": null, "bias": true, "output_dim": 50, "trainable": true, "batch_input_shape": [null, 100], "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_8"}}, {"class_name": "Dense", "config": {"activation": "linear", "input_dtype": "float32", "input_dim": 50, "name": "dense_4", "b_regularizer": null, "bias": true, "output_dim": 10, "trainable": true, "batch_input_shape": [null, 50], "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_9"}}, {"class_name": "Dense", "config": {"activation": "linear", "input_dtype": "float32", "input_dim": 10, "name": "dense_5", "b_regularizer": null, "bias": true, "output_dim": 1, "trainable": true, "batch_input_shape": [null, 10], "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform"}}], "keras_version": "1.2.0"}